{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "851545de",
   "metadata": {},
   "source": [
    "A. Таблица умножения\n",
    "Вы невероятный человек! Добрались до задач 4 параграфа. Последний рывок и 2 глава позади.\n",
    "\n",
    "Это значит, что вы научились работать с простыми данными, условными операторами и циклами.\n",
    "Осталась последняя тема - вложенные циклы. Все следующие 20 задач будут посвящены этому.\n",
    "\n",
    "Начинаем с первой задачи!\n",
    "\n",
    "Местная фабрика канцелярских товаров заказала у вас программу, которая генерирует таблицы умножения.\n",
    "Давайте поддержим локального производителя!\n",
    "\n",
    "Напишите программу, которая по введённому числу n выводит таблицу умножения размера n × n.\n",
    "\n",
    "Формат ввода\n",
    "Вводится одно натуральное число — требуемый размер таблицы.\n",
    "\n",
    "Формат вывода\n",
    "Таблица умножения заданного размера."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0165b890",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 2 3 4 5 6 7 8 9 10 11 \n",
      "2 4 6 8 10 12 14 16 18 20 22 \n",
      "3 6 9 12 15 18 21 24 27 30 33 \n",
      "4 8 12 16 20 24 28 32 36 40 44 \n",
      "5 10 15 20 25 30 35 40 45 50 55 \n",
      "6 12 18 24 30 36 42 48 54 60 66 \n",
      "7 14 21 28 35 42 49 56 63 70 77 \n",
      "8 16 24 32 40 48 56 64 72 80 88 \n",
      "9 18 27 36 45 54 63 72 81 90 99 \n",
      "10 20 30 40 50 60 70 80 90 100 110 \n",
      "11 22 33 44 55 66 77 88 99 110 121 \n"
     ]
    }
   ],
   "source": [
    "N = int(input())\n",
    "for row in range(1, N + 1):\n",
    "    for col in range(1, N + 1):\n",
    "        print(row * col, end=' ')\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "96de570c",
   "metadata": {},
   "source": [
    "B. Не таблица умножения\n",
    "Фабрика снова с нами! Они остались в восторге от вашей таблицы, но теперь просят немного другой формат.\n",
    "Им нужна таблица умножения в виде списка выражений, а не прямоугольной сетки.\n",
    "\n",
    "Продолжим поддерживать местный бизнес, используя вложенные циклы.\n",
    "\n",
    "Напишите программу, которая по введённому числу n выводит все произведения чисел от 1 до n в виде отдельных выражений.\n",
    "\n",
    "Порядок важен: сначала фиксируем второе число (внешний цикл), а внутри — перебираем первое.\n",
    "\n",
    "Формат ввода\n",
    "Вводится одно натуральное число — требуемый размер «не таблицы».\n",
    "\n",
    "Формат вывода\n",
    "Не таблица умножения заданного размера."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "121521b4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 * 1 = 1\n",
      "2 * 1 = 2\n",
      "3 * 1 = 3\n",
      "1 * 2 = 2\n",
      "2 * 2 = 4\n",
      "3 * 2 = 6\n",
      "1 * 3 = 3\n",
      "2 * 3 = 6\n",
      "3 * 3 = 9\n"
     ]
    }
   ],
   "source": [
    "N = int(input())\n",
    "for row in range(1, N + 1):\n",
    "    for col in range(1, N + 1):\n",
    "        print(f\"{col} * {row} = {row * col}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0ddab6c9",
   "metadata": {},
   "source": [
    "C. Новогоднее настроение\n",
    "Великий математик Виталий Евгеньевич каждый Новый год проводит... на работе.\n",
    "Коллеги всегда любили и ценили его, поэтому в этом году решили сделать ему сюрприз — украсить кабинет учёного математическими ёлками.\n",
    "Конечно, без вашей помощи тут не обойтись.\n",
    "Нужно написать программу, которая создаст новогоднюю ёлку из чисел. Уверены, Виталий Евгеньевич будет рад!\n",
    "\n",
    "Напишите программу, которая по введённому числу n строит «математическую ёлку» — пирамидку из чисел.\n",
    "В первой строке одно число, во второй — два, в третьей — три... и так далее, пока не закончатся числа.\n",
    "\n",
    "Формат ввода\n",
    "Вводится одно натуральное число — количество чисел в математической ёлке.\n",
    "\n",
    "Формат вывода\n",
    "Требуемая новогодняя ёлка.\n",
    "1\n",
    "2 3\n",
    "4 5 6\n",
    "7 8 9 10\n",
    "11 12 13 14"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "14391177",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 \n",
      "2 3 \n",
      "4 5 6 \n",
      "7 8 9 10 \n",
      "11 12 13 14 "
     ]
    }
   ],
   "source": [
    "N = int(input())\n",
    "stair = 1\n",
    "numbers = 0\n",
    "for i in range(1, N + 1):\n",
    "    print(i, end=\" \")\n",
    "    numbers += 1\n",
    "    if numbers == stair:\n",
    "        print()\n",
    "        stair += 1\n",
    "        numbers = 0\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f04d785",
   "metadata": {},
   "source": [
    "D. Суммарная сумма\n",
    "Считать сумму цифр одного числа — не проблема.\n",
    "А вот если таких чисел несколько, причём каждое может быть многозначным, — тут уже интересно!\n",
    "\n",
    "К вам снова пришли за помощью: нужна программа, которая посчитает сумму всех цифр всех чисел, поданных на вход.\n",
    "Вы справитесь — у вас ведь уже есть всё необходимое: циклы и уверенность в своих силах!\n",
    "\n",
    "Формат ввода\n",
    "В первой строке указано число \n",
    "N\n",
    "N.\n",
    "Во всех последующих \n",
    "N\n",
    "N строках написано по одному натуральному числу.\n",
    "\n",
    "Формат вывода\n",
    "Требуется вывести общую сумму цифр всех введённых чисел (кроме \n",
    "N\n",
    "N)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "91f9d7b2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "9\n"
     ]
    }
   ],
   "source": [
    "N = int(input())\n",
    "sum_a = 0\n",
    "for i in range(N):\n",
    "    a = int(input())\n",
    "    while a:\n",
    "        sum_a += a % 10\n",
    "        a = a //10\n",
    "print(sum_a)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "ml-journey",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
