{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "6d1af275",
   "metadata": {},
   "source": [
    "A. Азбука\n",
    "Малыши начали учить алфавит. Воспитатель попросил их назвать слова, начинающиеся только с букв а, б или в.\n",
    "\n",
    "Напишите программу, которая проверит, что все введённые слова соответствуют этим правилам.\n",
    "\n",
    "Формат ввода\n",
    "Вводится натуральное число \n",
    "N — количество слов, названных детьми.\n",
    "В каждой из последующих \n",
    "N строк записано по одному слову строчными буквам.\n",
    "\n",
    "Формат вывода\n",
    "YES — если все слова начинаются с нужной буквы.\n",
    "NO — если хотя бы одно слово начинается не с нужной буквы."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "ac4eabc9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "YES\n"
     ]
    }
   ],
   "source": [
    "N = int(input())\n",
    "count = 0\n",
    "for i in range(N):\n",
    "    name = input()\n",
    "    if name[0] in 'абв':\n",
    "        count += 1\n",
    "if count == N:\n",
    "    print(\"YES\")\n",
    "else:\n",
    "    print(\"NO\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "69a165e5",
   "metadata": {},
   "source": [
    "B. Кручу-верчу\n",
    "Иногда в текстовых редакторах возникает необходимость повернуть строку — то есть сделать из горизонтальной записи вертикальную.\n",
    "В Python такая функция по-умолчанию отсутствует, но это не проблема: мы напишем её сами!\n",
    "\n",
    "Напишите программу, которая преобразует введённую стоку из горизонтальной записи в вертикальную.\n",
    "\n",
    "Формат ввода\n",
    "Одна строка.\n",
    "\n",
    "Формат вывода\n",
    "Вертикальное представление введённой строки."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "c330f641",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "П\n",
      "р\n",
      "и\n",
      "в\n",
      "е\n",
      "т\n"
     ]
    }
   ],
   "source": [
    "name = input()\n",
    "for i in range(len(name)):\n",
    "    print(name[i])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6a77a914",
   "metadata": {},
   "source": [
    "C. Анонс новости\n",
    "Когда вы работаете со строками, часто приходится управлять их длиной — особенно в реальных проектах: сайтах, приложениях, чат-ботах.\n",
    "В этой задаче вы выступите в роли разработчика новостного сайта.\n",
    "\n",
    "Местная редакция заказала у вас систему для отображения заголовков. Чтобы лента была удобной, слишком длинные заголовки нужно сокращать и добавлять многоточие.\n",
    "\n",
    "Напишите программу, которая сокращает заголовки до требуемой длины.\n",
    "\n",
    "Если заголовок длиннее, он должен быть усечён и завершён многоточием ....\n",
    "Если заголовок помещается в заданную длину — выводите его без изменений.\n",
    "Формат ввода\n",
    "Вводится натуральное число \n",
    "L — необходимая длина заголовка.\n",
    "Вводится натуральное число \n",
    "N — количество заголовков, которые требуется сократить.\n",
    "В каждой из последующих \n",
    "N строк записано по одному заголовку.\n",
    "\n",
    "Формат вывода\n",
    "Сокращённые заголовки.\n",
    "\n",
    "Примечание\n",
    "Многоточие учитывается при подсчёте длины заголовка."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "90d38ae7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Пр...\n",
      "Пока\n"
     ]
    }
   ],
   "source": [
    "L = int(input())\n",
    "N = int(input())\n",
    "\n",
    "for i in range(N):\n",
    "    title = input()\n",
    "    if len(title) <= L:\n",
    "        print(title)\n",
    "    else:\n",
    "        print(title[:L-3], end=\"...\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b76e71e1",
   "metadata": {},
   "source": [
    "D. Очистка данных\n",
    "Работая с реальными текстовыми файлами и логами, почти всегда приходится сталкиваться с «грязными» данными: лишними символами, мусорными строками, ошибками форматирования.\n",
    "\n",
    "В этой задаче вы поможете местному провайдеру почистить отчёты: устраните системные ошибки и оставите только полезную информацию.\n",
    "\n",
    "Напишите программу, которая обрабатывает лог-файл, состоящий из строк, и:\n",
    "\n",
    "удаляет две решётки ## в начале строки, если они есть;\n",
    "удаляет всю строку, если она заканчивается на @@@.\n",
    "Ввод продолжается, пока не встретится пустая строка.\n",
    "\n",
    "Формат ввода\n",
    "Вводятся строки отчёта. Признаком завершения ввода считается пустая строка.\n",
    "\n",
    "Формат вывода\n",
    "Очищенные данные."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "ed9e7a69",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "First Message\n",
      "Second Message\n",
      "@@@Third Message##\n"
     ]
    }
   ],
   "source": [
    "while (strok := input()) != \"\":\n",
    "    if strok.endswith(\"@@@\"):\n",
    "        continue\n",
    "    if strok.startswith(\"##\"):\n",
    "        strok = strok[2:]\n",
    "    print(strok)\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "ml-journey",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
